app/controllers/lovers/orders_controller.rb

	def new
		@neworder = Order.new
		path = Rails.application.routes.recognize_path(request.referer)

		if session[:create] == "create"
			session[:create] = nil
			new_destination = Destination.order("created_at DESC").find_by(user_id: current_user.id)
			@neworder.last_name = new_destination.last_name
			@neworder.first_name =  new_destination.first_name
			@neworder.last_name_kana =  new_destination.last_name_kana
			@neworder.first_name_kana =  new_destination.first_name_kana
			@neworder.postal_code =  new_destination.postal_code
			@neworder.prefecture =  new_destination.prefecture
			@neworder.city =  new_destination.city
			@neworder.building =  new_destination.building
			@neworder.phone_number =  new_destination.phone_number

		elsif session[:default] == "default"
			session[:default] = nil
			@user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def show
		@orders = Order.find_by(params[:id])
    	@order  = Order.find(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def create
	    ActiveRecord::Base.transaction do #トランザクション処理を定義
	    	# ↓実行したい、例外が発生する可能性のある処理を記述↓
	    	@user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]