app/controllers/lovers/user_items_controller.rb

  def method
    @user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def cart_stock
    # カートの中身全取得
    @user = User.find(current_user.id)
    @user_items = @user.user_items

    # 在庫減らす処理 実装できた
    @user_items.each do |user_items|
    user_items.item.stock -= user_items.quantity
    user_items.item.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "user_items".* FROM "user_items" WHERE "user_items"."user_id" = ?  [["user_id", 1]]
UPDATE "items" SET "stock" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["stock", 98], ["updated_at", "2018-03-17 09:03:56.939522"], ["id", 1]]

  def cart_save
    # カートの中身全取得
    @user = User.find(current_user.id)
    @user_items = @user.user_items

    # カート中身を一つずつ削除するアクション
    @user_items.each do |user_items|
      user_items.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "user_items".* FROM "user_items" WHERE "user_items"."user_id" = ?  [["user_id", 1]]
DELETE FROM "user_items" WHERE "user_items"."id" = ?  [["id", 1]]